Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УчетнаяПолитика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Проверяем остатки ПЕРЕД проведением
	МассивНехватки = ПроверитьОстаткиТоваров();
	
	// Если есть нехватка товаров - блокируем проведение
	Если МассивНехватки.Количество() > 0 Тогда
		ТекстСообщения = "НЕВОЗМОЖНО ПРОВЕСТИ ДОКУМЕНТ!" + Символы.ПС + Символы.ПС + "Недостаточно остатков на складе:" + Символы.ПС + Символы.ПС;
		
		Для каждого Элемент Из МассивНехватки Цикл
			ТекстСообщения = ТекстСообщения + "  • " + Элемент.Номенклатура + ": нехватка " + Формат(Элемент.Нехватка, "ЧГ=0") + " шт." + Символы.ПС;
		КонецЦикла;
		
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Если все ОК - формируем движения по регистру ОстаткиНоменклатуры (РАСХОД)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.Услуга = ЛОЖЬ
		|	И РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// Регистр ОстаткиНоменклатуры РАСХОД
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Партии = Партия;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Стоимость = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецПроцедуры

// ============================================
// ФУНКЦИЯ ПРОВЕРКИ ОСТАТКОВ
// ============================================

Функция ПроверитьОстаткиТоваров()
	
	МассивВозврата = Новый Массив();
	
	// Защита 1: Проверяем наличие товаров
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Возврат МассивВозврата;
	КонецЕсли;
	
	// Защита 2: Выгружаем и сворачиваем по номенклатуре
	ВыбранныеТоварыТЗ = СписокНоменклатуры.Выгрузить();
	ВыбранныеТоварыТЗ.Свернуть("Номенклатура", "Количество");
	
	Попытка
		// Подготавливаем запрос к регистру остатков
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ТекущаяДата, Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиНоменклатурыОстатки";
		
		// Устанавливаем параметры запроса
		Запрос.УстановитьПараметр("СписокНоменклатуры", ВыбранныеТоварыТЗ.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ТекущаяДата", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
		
		// Выполняем запрос
		РезультатЗапроса = Запрос.Выполнить();
		ОстаткиНоменклатурыИзЗапроса = РезультатЗапроса.Выгрузить();
		
		// Проверяем каждый товар из документа
		Для каждого СтрокаТаблицы Из ВыбранныеТоварыТЗ Цикл
			
			// Пропускаем товары с нулевым количеством
			Если СтрокаТаблицы.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Ищем остаток по товару
			ОстатокНайти = ОстаткиНоменклатурыИзЗапроса.Найти(СтрокаТаблицы.Номенклатура, "Номенклатура");
			
			// Если товара нет в остатках
			Если ОстатокНайти = Неопределено Тогда
				Элемент = Новый Структура("Номенклатура,Нехватка", СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Количество);
				МассивВозврата.Добавить(Элемент);
			
			// Если остатка недостаточно
			ИначеЕсли ОстатокНайти.КоличествоОстаток < СтрокаТаблицы.Количество Тогда
				Нехватка = СтрокаТаблицы.Количество - ОстатокНайти.КоличествоОстаток;
				Элемент = Новый Структура("Номенклатура,Нехватка", СтрокаТаблицы.Номенклатура, Нехватка);
				МассивВозврата.Добавить(Элемент);
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		// Логируем ошибку
		ЗаписьЖурналаРегистрации("ПроверкаОстатков", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецПопытки;
	
	Возврат МассивВозврата;
	
КонецФункции
